//1. Нужно написать свой собственный класс контейнер.
//
//        · Нельзя использовать Java классы (ArrayList и т.п.)
//
//        · Объект этого класса должны иметь возможность хранить неограниченное
//        количество объектов, т.е. можно создать класс на основе массива, написать
//        процедуру расширения (создать новый массив, переписать из старого элементы и занести новый)
//
//        · Написать методы add, get, set, delete, и т.п.


public class Main {
    public static void main(String[] args) {

    }
}
